In [ ]:
import pandas as pd

- 연습문제

1. csv폴더 안에 있는 'Sales Records.csv' 파일 로드 
2. 'Order ID', 'Total Revenue', 'Total Cost', 'Total Profit', 'Order Priority' 컬럼을 제거 
3. 컬럼의 이름 변경 : ['대륙', '국가', '상품종류', '판매채널', '주문일자', '발송일자', '판매개수', '단가', '원가']
4. 대륙, 국가를 기준으로 오름차순 정렬
5. 파생변수 생성
    - 총단가 -> 판매개수 * 단가
    - 총원가 -> 판매개수 * 원가 
    - 총이윤 -> 총단가 - 총원가

In [ ]:
# 파일을 로드 
sales = pd.read_csv("../../csv/Sales Records.csv")

In [ ]:
sales.info()

In [ ]:
df = sales.copy()

In [ ]:
# 특정 컬럼을 제거 
# drop()
df.drop([
    'Order ID', 'Total Revenue', 'Total Cost', 'Total Profit', 
    'Order Priority'
], axis = 'columns', inplace=True)

In [ ]:
# 컬럼의 이름 변경 
df.columns = ['대륙', '국가', '상품종류', '판매채널', '주문일자', 
'발송일자', '판매개수', '단가', '원가']

In [ ]:
df.head(1)

In [ ]:
# 정렬을 변경 : 대륙, 국가
# 오름차순
# df.sort_values('대륙', inplace = True)
# df.sort_values('국가', inplace = True)
df.sort_values( ['대륙', '국가'], inplace=True )
df.head()

In [ ]:
# 총단가(Series) = 판매개수(Seires) * 단가(Series)

df['총단가'] = df['판매개수'] * df['단가']
df['총원가'] = df['판매개수'] * df['원가']
df['총이윤'] = df['총단가'] - df['총원가']

In [16]:
df.head()

,대륙,국가,상품종류,판매채널,주문일자,발송일자,판매개수,단가,원가,총단가,총원가,총이윤
7776,Asia,Bangladesh,Personal Care,Online,11/6/2010,11/13/2010,3246,81.73,56.67,265295.58,183950.82,81344.76
910,Asia,Bangladesh,Cereal,Online,11/20/2015,12/26/2015,2691,205.70,117.11,553538.70,315143.01,238395.69
9756,Asia,Bangladesh,Office Supplies,Online,12/1/2016,1/20/2017,3907,651.21,524.96,2544277.47,2051018.72,493258.75
9763,Asia,Bangladesh,Baby Food,Online,2/4/2016,3/4/2016,99,255.28,159.42,25272.72,15782.58,9490.14
5674,Asia,Bangladesh,Fruits,Online,11/15/2011,11/16/2011,6729,9.33,6.92,62781.57,46564.68,16216.89

In [26]:
# 총 이윤의 합계가 가장 높은 국가는 어디인가?
# 국가별로 데이터프레임을 나눠주는 작업 
# 그룹화 함수 groupby()
# df[['국가', '총이윤']].groupby('국가').sum()
group_data = df.groupby('국가')[['총이윤']].sum()

In [28]:
# 총이윤이 가장 높은 10개의 국가를 출력
group_data.sort_values('총이윤', ascending=False).head(10)

                    총이윤
국가
Kiribati    32454798.26
Qatar       30861356.79
Grenada     30302769.90
Taiwan      30044779.98
Malawi      29329125.05
Botswana    29019726.67
Bangladesh  28092720.77
Lithuania   28063374.02
Burundi     27911293.45
Ireland     27807805.05

In [29]:
# 해당하는 데이터에서 South Korea의 순위는 몇위인가?
# 그룹데이터를 총이윤을 기준으로 내림차순 정렬
group_data.sort_values('총이윤', ascending=False, inplace=True)

In [37]:
result = 0
for i in group_data.index:
    # print(i)
    # break
    result += 1
    if i == 'South Korea':
        break
print(result)

48

In [41]:
list(group_data.index).index('South Korea') + 1

48

In [44]:
# group_data에서 인덱스를 초기화하고 기존의 인덱스를 컬럼으로 유지
group_data2 = group_data.reset_index()
group_data2.loc[ group_data2['국가'] == 'South Korea' ]

             국가          총이윤
47  South Korea  23893933.75

In [48]:
# rank() 함수를 이용 
group_data['rank'] = group_data['총이윤'].rank(ascending= False)

In [50]:
group_data.loc[ ['South Korea'] ]

                     총이윤  rank
국가
South Korea  23893933.75  48.0

In [53]:
df[['국가', '총이윤']].groupby('국가').get_group('South Korea')

               국가         총이윤
2745  South Korea    83170.26
8028  South Korea   299867.50
6284  South Korea   294188.04
3010  South Korea   752980.30
951   South Korea   235767.72
4050  South Korea   428603.22
1737  South Korea   163920.60
8910  South Korea    20868.19
1771  South Korea   653307.66
7175  South Korea    71571.36
9261  South Korea  1076028.75
8003  South Korea   224895.61
4666  South Korea    11336.64
4927  South Korea   496267.20
4904  South Korea    10907.66
6899  South Korea   207100.80
874   South Korea   763849.57
9523  South Korea   481041.36
7784  South Korea   812739.92
7332  South Korea   102870.54
6305  South Korea   338044.32
2109  South Korea   436836.40
8121  South Korea     2423.52
3107  South Korea   242778.75
822   South Korea   401475.00
5489  South Korea     5888.16
9093  South Korea    21220.05
3889  South Korea   212369.32
9129  South Korea  1359648.92
1812  South Korea   225865.78
9625  South Korea    55195.14
2597  South Korea   523158.31
5036  South Korea   392067.40
4325  South Korea  1361471.95
9913  South Korea  1044592.50
7364  South Korea   160484.24
6329  South Korea   311748.91
1758  South Korea   880053.06
953   South Korea    17038.70
4230  South Korea   824396.00
6232  South Korea   145072.34
2495  South Korea   384155.20
5934  South Korea   345388.32
4073  South Korea   174803.20
3224  South Korea   657888.75
7223  South Korea   310383.06
7557  South Korea   530680.96
5196  South Korea   603270.28
6723  South Korea   216093.66
999   South Korea  1098248.75
3342  South Korea   373729.60
2772  South Korea   157112.04
5802  South Korea   562014.96
4537  South Korea   203174.40
598   South Korea    92240.64
4536  South Korea   498376.14
3427  South Korea   777997.38
4635  South Korea   220589.10
9283  South Korea   220377.64
7385  South Korea   314298.00